//*****************************************************************************
//
// Имя файла    : 'pio.h'
// Заголовок    : Драйвер модуля Parallel Input Output Controller (PIO)
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 29/06/2012
//
//*****************************************************************************

#ifndef _PIO_H
#define _PIO_H

#include "types.h"
#include "core\processor.h"
      
// ============================================================================
///                             Типы                      
// ============================================================================

    enum EPinCfg
    {
        // Конфигурация "Вход" (без подтяжки)
        PIN_INPUT           = 0,
        // Конфигурация "Вход" (с подтяжкой)
        PIN_INPUT_DRIVE     = 1,
        // Конфигурация "Выход"
        PIN_OUTPUT          = 2
    };

// ============================================================================
///                             Прототипы функций                      
// ============================================================================

    // Конфигурирование линии ввода/вывода
    void cfg_pin (uint pin, EPinCfg cfg);

    // Установка заданного уровнь на линии
    void set_pin (uint pin, bool state);
    // Установка выхода в "1"
    void set_pin (uint pin);
   // Установка выхода в "0"
    void clr_pin (uint pin);
    // Инверсия состояния выхода 
    void inv_pin (uint pin);
    // Чтение состояния линии
    bool get_pin (uint pin);
    
#endif // #ifndef _PIO_H