//*****************************************************************************
//
// Имя файла    : 'ta.h'
// Заголовок    : Драйвер модуля Timer A (TA)
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 03/06/2012
//
//*****************************************************************************

#ifndef _TA_H
#define _TA_H

//#include "core\aic.h"
#include "core\processor.h"

// ============================================================================
//                              Классы
// ============================================================================

class CTimerA 
{
    private:
        // Поиск лучшего делителя MCK для указанной частоты таймера
        void FindMckDivisor   (uint freq, uint32 mck, uint* tcclks, uint* counter);
    public:
        // Конструктор
        CTimerA();
        // Конфигурация таймера
        void Configure (uint freq, /*THandlerISR* handler,*/ uint param);
        // Деинициализация таймера
        void UnInit    (void);
        
        // Запуск таймера
        void Start      (void);
        // Остановка таймера
        void Stop       (void);
        // Перезапуск таймера
        void Restart    (void);
        // Разрешение прерываний
        void EnableIrq  (void);
        // Запрет прерываний
        void DisableIrq (void);
            
        // Установка приоритера прерываний модуля
        void SetPriority (uint priority);
};

// ============================================================================
//                          Внешине зависимости
// ============================================================================
    
    extern CTimerA  ta;
#endif //#ifndef _TA_H

